Revit 2027 API
SunAndShadowSettings.TimeZone Property
 Identifies the time zone.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TimeZone { get; }
Public ReadOnly Property TimeZone As Double
	Get
public:
property double TimeZone {
	double get ();
}
member TimeZone : float with get
Property Value
Double
Remarks
 Identifies the time zone used by the SunAndShadowSettings element. This property indicates the time zone in which the site resides. The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace